003.org
#+title: Thag
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="index.css" />
#+OPTIONS: num:nil
#+OPTIONS: toc:nil

Club-drill was excruciating to the Grav and Gog in ways that they couldn't manage to communicate to others. It was mostly about being told what to do and being criticized by the ignorant and linear thinkers that were inevitably the "top bronze"; often criticized for doing exactly what you were told to do.

Another concept they wouldn't be able to explain or even be aware exists was "selection bias". It's a subtle idea. It would be a while before that one got identified and tagged.

In words that a Crec might understand: The cavemen who made their way to the top in the hierarchy were the type who really liked bossing people about. They were cavemen who were violently uninterested in the wisdom of their plans for /you/.

Given enough cavemen, you will find some outliers. You may not know anyone who likes to give orders, doesn't like to be questioned, and doesn't care whether they are "right" by /your/ definition, but how many CO's[fn:: Cave Officer] does one need? Not many. And being the scrappy sort they will, in stages, work their way toward their dream job. Everyone should. Recruiting was no small part of the Armed-Forest. Outreach, recruitment and other kinds of advertising paid off in their growth, and in the recruitment of many particular /types/ to fill corresponding /roles/.

As a Crec you could and probably would some day be drafted. But to make a career out of it was a different tack. If drafted and not a CO, you pretty much spent all your time either killing, being killed, or learning to kill. CO's were more the managerial type.

And since your fate was to be involved in all this anyway, /completely voluntary/ "club-drills" were regularly held in locations around the Forest. If bloody combat was going to inevitably happen, one may as well be among the best-prepared.

You may have stopped and wondered yourself: What was it like to be among a sea of men on opposing "teams", all literally in a life-or-death fight with both sharp and blunt weapons of war, /right there in front of you/, wanting to kill you. And you wanting to kill /them/ because of that fact. It's an unimaginably frightening thought when it's both real and likely. Try and touch that kind of terror in yourself. See if you can imagine yourself in that terrifying bloody mess: This is what motivated Grav and Gog to trek all this way, all-too-regularly.

The clubbing-camps were usually overseen by some Great Bear war hero. "Choh-Ov", the camp nearest Bhorv Zolk was run by Verk. The title of this role, the camp head, was Mother Bear[fn:: Absolutely no one saw a hint of humor or absurdity in this title. Yes, it was well known that mother bears are female, but mother bears were and are fierce as monkey-business.]. Verk was Choh-Ov's Mother Bear.

Fayt-Caves, which entirely surrounded Choh-Ov, was a shanty town, but carved out of rock, which really looks nicer than shanty any way you cut it. Fayt-Caves was seedy, crime-ridden, full of loud parties on an ongoing basis, had an entire district devoted to hire-baby-makers and their trade. Choh-Ov was more or less the yolk of this sad, desperate fried egg.

And it was small-knowledge[fn:: 'small[-one]-knowledge': common sense, widely known.] that this was the norm: Surrounding more or less every clubbing-camp in the Forest and its protectorates was a 'bad neighborhood' by most definitions. No one thought this amiss. It was never questioned[fn:: This effect was also seen surrounding Crec's very few places of high learning, 'scratching-camps'].

Grav and Gog had decided to leave the day after the revelation of Ender's-Sword, giving them the opportunity to take make a leisurely day of it. They only needed to cover one and one half of one all-finger palm[fn:: About 30 'imperial' miles.] of pretty standard jungle, woods, and scrubby savanna; the way well-traveled and therefore clearly marked, well serviced by vendors, and safe-with-many. They had even let themselves sleep in a bit[fn:: With rare exception, all cavepeople woke at dawn, even on deeply overcast days. Another palm of sleep more, if you found a place dark enough, was considered decadent.]. Since the final part of the journey crossed a wide, flat, scrubby plain and the moon was sufficiently bright, they would be able to travel for hours after dark set in.

In the worst case, they planned to bivouac one night, wake up early and arrive at Choh-Ov before conch.

As Bhorv Zolk faded into the distance, the path to the morning-sun-left-back-side[fn:: Northwest.] was gently rolling hills and low shrubs for a palm or more. Bhorv Zolk could be seen fading into the distance, which was a nice way to say goodbye to home. One got a feeling that it was very big, being visible from all this way, and would therefore surely be there when you got back[fn:: And coming back was also a nice, slow 'hello'. You felt 'home' many palm before you actually were.].

Gog hummed, whistled, yipped, and struck various parts of his body, making a sort of improvised song.

"Feedback" of any kind between the two men usually took the form of cutting, merciless criticism from one toward the other. In a way, it was their stick[fn:: While "comedy" in Crec was not recognized as an art form, much less a profession, certain people were marked as cut-ups and some were clearly gifted in the art of inducing laughter. To the extent that it existed, comedy in Crec was always of the physical sort and therefore often employed a stick. One could use a stick to rap another over the head, as a way to punctuate observations about their ineptness. One could use a stick to trip another, causing an often bloody spill that was sure to snare onlookers into laughter. Therefore, one's "signature" in a comedy sense was referred to as one's "stick".]. Grav withheld his commentary on Gog's music. Grav would never say such out loud, but Gog was definitely quite talented as a song-maker.

He'd tried working on convincing Gog to have a visit with Snogny-Dodk, the music-scratcher nearest Bhorv Zolk. Business was good, and all manner of copy-protection[fn:: Appendix: Snogny-Dodk Copy-Protection Technology] schemes were the key to success, Snogny-Dodk knew[fn:: But would not share.]. He had a regular rotation of all-finger-and throat-and-drum-choirs that would snare[fn:: As in the impromptu bush trap. Their word for "kill at" or "really make a killing".] his most profitable demographic: all-finger-and boys trying to woo their crush by performing some music or other, using /his/ scratching standards and training system.

Selling the materials needed to perform a cover of the latest hit was really all there was in the music business, outside of performing of course, for which you would need security and acoustical expertise.

Knowing that he would get no movement from Gog, who liked to play friendly-decorator-bird[fn:: False-modesty.], Grav decided to just enjoy the well selected traveling music and think a squirrel-hoard about how to best navigate the next few days. This was just baseline thinking-ahead for him. Nothing was worrying him in particular.

Would word about their find have made its way yet? Not feeling any particular need to be there, Verk, whose methods were not questioned, would not be at the camp. He would make his way back eventually, at his own pace, likely after Grav and Gog had gone. Verk, retinue, and Under-Men would not have returned to Fayt-Caves yet.

Verk could easily send a message. He probably had, given that he was now, to none of their surprise, going to wrap himself all the around this[fn:: 'Take credit for'. If you are 'half wrapped around' you are taking half credit. If you are 'wrapped all the way around', you were taking full credit. The "unearned" part is always implied.].

xxx we use Under-Men to both mean "verk's thugs" and "the learned men in the ancient-speak burrow"... must untangle. xxx

And even if none of that, there was a regular flow of traffic to and from Fayt-Caves; men attending club-drill, general commerce, or newly-married baby-makers relocating to their new home[fn:: This journey, no matter how long, was always made alone. Crec Cavewomen were nearly universally safe from abuse at the hands of men, but that was not the only risk that women uniquely share as a group. Survival of any but the most hardy among women was legitimately at risk on any lone trek that took more than one day. Of course each additional night added to the risk. Everyone was at risk at all times, but more so at night. For men, this risk was thought to be "manageable". It was markedly greater for any lone women. It was considered bad form to approach a women while on her selection-journey. A pious caveman would politely ignore a women being mauled by a tooth-cat for example.]. The traffic was always "very light". You might see three or four other parties over two nights. The parties might be of size one or all-finger all-finger. In certain seasons, you might encounter no one.

It was hard to say, in other words.

A few palm outside of Fayt-Caves, Verk owned what would be considered a castle almost universally; a point that the men would pass late that evening, if they kept their pace.

"Would word of the Ender's-Sword have made it to Choh-Ov?", Grav wondered allowed.

Without breaking his stride, Gog abruptly stopped his music and looked at Grav, possibly thinking, or possibly for superb comedic timing.

"You mean Ender's-Stump?"

Grav's run became a staggering, rhythmic stomp as he laughed maniacally while continuing to run. He eventually gave up on that and let himself fall into an enormous dark-purple heather shrub. He continued to laugh face-down at the dirt and detritus at the ancient shrub's base. Through his teary eyes he noticed an earthworm escaping downwards, away from him.

He eventually righted himself, making a lot of noise as he pushed himself up, snapping small branches and spitting out a sparse cloud of tiny purple petal glitter and twigs that had ended up in his open mouth.

"Scout[fn:: "Dude!!"], you need to lay off of that stuff! Not everyone is as mirth-filled as us, you know. The Forest Executioners are not known for their stoatishness[fn:: Sillyness].", said Grav.

"Eegh. I'm tired of worrying about it, to be frank." Gog was such an artist with his banana-language that he was no longer entertained by it, and so was laughing not at all. It seemed like he just thought of it as his 'job'; trudging through another day of saying things that caused others to nearly have a stroke with hilarity. "You know either of us could be dead tomorrow."

"Yeah, but probably not /from torture/.", reasoned Gog.

"I mean, yeah, of course I will always take reasonable precautions. But mount it, it becomes so much of a drain on me to constantly have to edit my words, that I'm willing to be a bit 'strategically reckless' in order to just relax for a /sewing/ change!!" Gog seemed to be shaking his head in disgust. "Also, always feeling like I want to live another day so that I can say as much banana as I want is its own kind of motivation to not get cheeped on[fn:: 'Snitched on', 'told on'. It was the the automonopoetic word for the sounds a baby bird makes, like in many langues, 'cheep'. So to 'cheap' on someone was to cry to mamma bird, in essence.]."

"There's some motivation.", pondered Grav.

"And they /are/ just words, aren't they?", he continued, now sharing some of Gog's annoyance at the arbitrariness of it all, though he was not yet an angry rebel like Gog. "It angers me too. Some things are at the same time both infuriatingly stupid and unjust, while at the same time being completely small-knowledge to seemingly everyone. Everyone gets so clubby[fn:: 'On edge'.] about /language/."

Grav continued. "Did you know that in Douks you can have three toenails pulled out for underpaying your take-value? Regardless of circumstances? At least the Crec haven't gone that crazy.

If you find something in the jungle of any value at all, the Douks Forest has a 'claim' on half of it, without any kind of justification. It's just /theirs/ and that's that!

How would you take-value half of one Ender's-Stump?"

Gog's cheeks tightened with the suppression of a smile.

"What has that got to do with what we're talking about?", asked Gog.

"Strain is strain, whether it's about taking value or removing freedom.

In a way, they're similar things; freedom and value. You can use your freedom to get value. Taking away your freedom is like taking value you don't yet have, because 'they' have wrecked your plans. Maybe /you/ want to be a professional banana-talker and charge value for your performances...!"

Both men snickered cynically while also thinking, /that'd be a cool job!/

Gog answered with a question, while smirking gratefully. "Are we really gonna trek it out the whole way through, without a bivouac?"

"Why not? So long as we hit Snare Plains by maybe one palm after sundown, we'll be set like a murderous monkey[fn:: A strange expression that means something like 'in like Flynn'. It comes from the observation that a monkey that has killed one of its own kind and is relaxing in its nest eating the corpse has a look of complete contentment, as though knowing this once-in-life indulgence may or may not shortly cost him /his/ life, or maybe ostracization, sometimes even with a bloody smile that humans easily pick up on. 'Get while the getting is good!', the monkey might say, smacking the words with blood.]."

"That's three palm of walking in the dark in Small Woods."[fn:: The triviality of this observation did not occur to Gog.]

"Less than /one and one half/ of one palm, and /running/!", corrected Grav helpfully.

Much later, it getting dark and their nearing the end of Small Woods, they encountered a forest-child[fn:: Appendix: forest-child] whose path was intersecting with the only established trail for several palm, as seems always to be the case with the forest-children, and only in the Forest; /any/ Forest, really, but not on a plain for example.

"Greetings cheerful fellow traveler!", said Grav loudly, there never having been any sense of fear about them from anyone that he could recall, and Grav anticipating a reliably predictable sequence of events to follow.

Grav knew his opening comment would be ignored for signs of "foreignness", far from having fact that they were speaking separate languages considered, and also knowing he would not be able to make anything of the traveler's response.

The bulk of these encounters were eerily similar to one another, and each time it seemed they had to build their pantomime vocabulary with them from scratch. But they were practiced, and both men knew in any case, they'd have to get through the first, rather long part where the forest-child is unaware they do not understand.

And for all anyone could tell, a forest-child /was/ a child. It was astonishing. No matter how hard anyone had tried, they couldn't make out any dwarfish features. Other than often being scarred and every so often missing fingers, teeth, eyes, or limbs, and but for toned muscles under the leathery, tough skin, they were what we moderns would call "toddlers".

They did not know Crecspeak or anything remotely like it, but were evidently fluent in some kind of language. The small boy[fn:: No one had ever seen a female, and anyway it was always apparent the present company was male in gender.] slouched in a way that a very relaxed, fit, successful older caveman would; a standing slouch that said he could take them or leave them. Or possibly even kill them. But he showed no sense of fear or hatred, just casual toddlerness. They smoked a pipe in about half the cases. This one was not a partaker[fn:: The ones that smoked, really smoked, and somehow seemed to reeked of whatever weed they smoke even upwind. There were other ever-present "base tones" that they all had. They carried along with them a sort of weather system of gnats, flies and stink. An observation that might have been helpful for the non-smokers, if it could ever be conveyed was, the smokers had noticeably fewer flying pests.]. He currently stood with the sole of one foot resting on the calf of the other leg, with an all-wood spear, at least three times his height stuck in the ground and currently serving as just a staff to lean on, ever casually.

And predictably, from appearances, the toddler had not yet considered that the two men might not understand his language. He paused very briefly on occasion in a way that suggested he was baffled by the lack of a response, but continued on just the same.

After an especially baffling non-response, Grav took the initiative to blow away his new friend with some casual, pithy, fluently spoken Crec utterances[fn:: It had been observed that trying to speak to them clearly and slowly only resulted in them usually thinking you were an especially hard-to-understand individual, maybe with a jaw injury, which was common among primates of all sorts, or a head injury which is maybe even more likely. The secret was to make it clear that you were rapidly saying a whole bunch of complicated stuff, only /in another language/. Humans of all kinds have a remarkable ability to identify /fakers/; speaking rapidly in an impromptu, made-up language (conveying no information) is something distinguishable from /the actual conveyance of information/ in a real language, even if an unknown language. This trick reliably brought any forest-child right out of their fog.]; asking all kinds of questions about who cleaned him after scat time, where was this crazy toddler kingdom located, did he live in a mushroom, and aside from one's thumb, what kind of things were out there in the woods to suck on for an active baby like himself.

The light of understanding, forgiveness, and kindness toward new friends dawned on the toddler's honest face. He bowed slightly, showing who-knows-what to the woods behind him.

He made a lot of "we friends" gestures with his hands, his heart, and his mostly toothless smile. Grav and Gog mimicked the ones they felt pretty sure about.

Grav turned to Gog. "How is your forest-child-babble?"

Gog said, "More importantly what do we want to ask him. He's full of helpful answers, all written in High Ancient Balrag. What can we get out of him?—then maybe see if he jumps for joy at a polished uvula."

Grav looked at the sky through the canopy and thought for a considerable while.

"Ok. Translator, ask him if he would chance the remainder of the Little Woods at a leisurely walk on our way to Snare Plain, or would he run like scat?", Grav said to Gog.

"Oh. Thanks for starting with an easy one."

The woods, especially near the plains were a lively hunting ground just as soon as it was dark enough; for all kinds of big, bigger-than-you things made from muscle, teeth and claws. The plain, being a safer place at night, generally, only required you keep a speedy pace and make a lot of noise at intervals. This done, you rarely got messed with.

"Don't you think that'd be handy to know?"

"If we were that worried, we'd be running right now."

While the men were talking, the forest-child made a series of gestures. "Warning" and "no" and "great death" could be seen on his countenance as he made his interpretive dance.

"Flying?", Gog thought he had picked up.

"Mouth? Beak?", Grav tried to help, in this elite version of Pictionary, where the audience is more or less dumb, at least from the forest-child's perspective.

"Is that a tail? Egg?"

"Lizard bird?", asked Grav.

"I'm pretty sure he is saying lizard-bird something. Egg... Could it be eating for two and therefore especially hungry?", Gog asked Grav while making intense, questioning eye contact with the forest-child.

His feedback from the toddler was a shrug. Grav made a "big eat-y beak" gesture with his two outstretched arms, perhaps with fingers playing the roll of some hooked teeth at the tips.

The toddler's eyes made saucers. He pointed at Grav and jumped rapidly with bent knees, his torso more or less stationary, as one might at the height of a Pictionary nail-biter.

Lizard-bird could and would kill men. There was no /scoop 'em up with the beak and swallow whole/. No, that would be a better fate. Someone from their and most others' childhood shared-experience was quite impactful in their respect for lizard-bird.

Both men fondly recalled this cheerful caveman as they independently began formulating plans.

