003.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-10 Fri 10:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Thag</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Michael Burr" />
<link rel="stylesheet" type="text/css" href="index.css" />
</head>
<body>
<div id="content">
<h1 class="title">Thag</h1>
<p>
Club-drill was excruciating to the Grav and Gog in ways that they couldn't manage to communicate to others. It was mostly about being told what to do and being criticized by the ignorant and linear thinkers that were inevitably the "top bronze"; often criticized for doing exactly what you were told to do.
</p>

<p>
Another concept they wouldn't be able to explain or even be aware exists was "selection bias". It's a subtle idea. It would be a while before that one got identified and tagged.
</p>

<p>
In words that a Crec might understand: The cavemen who made their way to the top in the hierarchy were the type who really liked bossing people about. They were cavemen who were violently uninterested in the wisdom of their plans for <i>you</i>.
</p>

<p>
Given enough cavemen, you will find some outliers. You may not know anyone who likes to give orders, doesn't like to be questioned, and doesn't care whether they are "right" by <i>your</i> definition, but how many CO's<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> does one need? Not many. And being the scrappy sort they will, in stages, work their way toward their dream job. Everyone should. Recruiting was no small part of the Armed-Forest. Outreach, recruitment and other kinds of advertising paid off in their growth, and in the recruitment of many particular <i>types</i> to fill corresponding <i>roles</i>.
</p>

<p>
As a Crec you could and probably would some day be drafted. But to make a career out of it was a different tack. If drafted and not a CO, you pretty much spent all your time either killing, being killed, or learning to kill. CO's were more the managerial type.
</p>

<p>
And since your fate was to be involved in all this anyway, <i>completely voluntary</i> "club-drills" were regularly held in locations around the Forest. If bloody combat was going to inevitably happen, one may as well be among the best-prepared.
</p>

<p>
You may have stopped and wondered yourself: What was it like to be among a sea of men on opposing "teams", all literally in a life-or-death fight with both sharp and blunt weapons of war, <i>right there in front of you</i>, wanting to kill you. And you wanting to kill <i>them</i> because of that fact. It's an unimaginably frightening thought when it's both real and likely. Try and touch that kind of terror in yourself. See if you can imagine yourself in that terrifying bloody mess: This is what motivated Grav and Gog to trek all this way, all-too-regularly.
</p>

<p>
The clubbing-camps were usually overseen by some Great Bear war hero. "Choh-Ov", the camp nearest Bhorv Zolk was run by Verk. The title of this role, the camp head, was Mother Bear<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>. Verk was Choh-Ov's Mother Bear.
</p>

<p>
Fayt-Caves, which entirely surrounded Choh-Ov, was a shanty town, but carved out of rock, which really looks nicer than shanty any way you cut it. Fayt-Caves was seedy, crime-ridden, full of loud parties on an ongoing basis, had an entire district devoted to hire-baby-makers and their trade. Choh-Ov was more or less the yolk of this sad, desperate fried egg.
</p>

<p>
And it was small-knowledge<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup> that this was the norm: Surrounding more or less every clubbing-camp in the Forest and its protectorates was a 'bad neighborhood' by most definitions. No one thought this amiss. It was never questioned<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup>.
</p>

<p>
Grav and Gog had decided to leave the day after the revelation of Ender's-Sword, giving them the opportunity to take make a leisurely day of it. They only needed to cover one and one half of one all-finger palm<sup><a id="fnr.5" class="footref" href="#fn.5">5</a></sup> of pretty standard jungle, woods, and scrubby savanna; the way well-traveled and therefore clearly marked, well serviced by vendors, and safe-with-many. They had even let themselves sleep in a bit<sup><a id="fnr.6" class="footref" href="#fn.6">6</a></sup>. Since the final part of the journey crossed a wide, flat, scrubby plain and the moon was sufficiently bright, they would be able to travel for hours after dark set in.
</p>

<p>
In the worst case, they planned to bivouac one night, wake up early and arrive at Choh-Ov before conch.
</p>

<p>
As Bhorv Zolk faded into the distance, the path to the morning-sun-left-back-side<sup><a id="fnr.7" class="footref" href="#fn.7">7</a></sup> was gently rolling hills and low shrubs for a palm or more. Bhorv Zolk could be seen fading into the distance, which was a nice way to say goodbye to home. One got a feeling that it was very big, being visible from all this way, and would therefore surely be there when you got back<sup><a id="fnr.8" class="footref" href="#fn.8">8</a></sup>.
</p>

<p>
Gog hummed, whistled, yipped, and struck various parts of his body, making a sort of improvised song.
</p>

<p>
"Feedback" of any kind between the two men usually took the form of cutting, merciless criticism from one toward the other. In a way, it was their stick<sup><a id="fnr.9" class="footref" href="#fn.9">9</a></sup>. Grav withheld his commentary on Gog's music. Grav would never say such out loud, but Gog was definitely quite talented as a song-maker.
</p>

<p>
He'd tried working on convincing Gog to have a visit with Snogny-Dodk, the music-scratcher nearest Bhorv Zolk. Business was good, and all manner of copy-protection<sup><a id="fnr.10" class="footref" href="#fn.10">10</a></sup> schemes were the key to success, Snogny-Dodk knew<sup><a id="fnr.11" class="footref" href="#fn.11">11</a></sup>. He had a regular rotation of all-finger-and throat-and-drum-choirs that would snare<sup><a id="fnr.12" class="footref" href="#fn.12">12</a></sup> his most profitable demographic: all-finger-and boys trying to woo their crush by performing some music or other, using <i>his</i> scratching standards and training system.
</p>

<p>
Selling the materials needed to perform a cover of the latest hit was really all there was in the music business, outside of performing of course, for which you would need security and acoustical expertise.
</p>

<p>
Knowing that he would get no movement from Gog, who liked to play friendly-decorator-bird<sup><a id="fnr.13" class="footref" href="#fn.13">13</a></sup>, Grav decided to just enjoy the well selected traveling music and think a squirrel-hoard about how to best navigate the next few days. This was just baseline thinking-ahead for him. Nothing was worrying him in particular.
</p>

<p>
Would word about their find have made its way yet? Not feeling any particular need to be there, Verk, whose methods were not questioned, would not be at the camp. He would make his way back eventually, at his own pace, likely after Grav and Gog had gone. Verk, retinue, and Under-Men would not have returned to Fayt-Caves yet.
</p>

<p>
Verk could easily send a message. He probably had, given that he was now, to none of their surprise, going to wrap himself all the around this<sup><a id="fnr.14" class="footref" href="#fn.14">14</a></sup>.
</p>

<p>
xxx we use Under-Men to both mean "verk's thugs" and "the learned men in the ancient-speak burrow"&#x2026; must untangle. xxx
</p>

<p>
And even if none of that, there was a regular flow of traffic to and from Fayt-Caves; men attending club-drill, general commerce, or newly-married baby-makers relocating to their new home<sup><a id="fnr.15" class="footref" href="#fn.15">15</a></sup>. The traffic was always "very light". You might see three or four other parties over two nights. The parties might be of size one or all-finger all-finger. In certain seasons, you might encounter no one.
</p>

<p>
It was hard to say, in other words.
</p>

<p>
A few palm outside of Fayt-Caves, Verk owned what would be considered a castle almost universally; a point that the men would pass late that evening, if they kept their pace.
</p>

<p>
"Would word of the Ender's-Sword have made it to Choh-Ov?", Grav wondered allowed.
</p>

<p>
Without breaking his stride, Gog abruptly stopped his music and looked at Grav, possibly thinking, or possibly for superb comedic timing.
</p>

<p>
"You mean Ender's-Stump?"
</p>

<p>
Grav's run became a staggering, rhythmic stomp as he laughed maniacally while continuing to run. He eventually gave up on that and let himself fall into an enormous dark-purple heather shrub. He continued to laugh face-down at the dirt and detritus at the ancient shrub's base. Through his teary eyes he noticed an earthworm escaping downwards, away from him.
</p>

<p>
He eventually righted himself, making a lot of noise as he pushed himself up, snapping small branches and spitting out a sparse cloud of tiny purple petal glitter and twigs that had ended up in his open mouth.
</p>

<p>
"Scout<sup><a id="fnr.16" class="footref" href="#fn.16">16</a></sup>, you need to lay off of that stuff! Not everyone is as mirth-filled as us, you know. The Forest Executioners are not known for their stoatishness<sup><a id="fnr.17" class="footref" href="#fn.17">17</a></sup>.", said Grav.
</p>

<p>
"Eegh. I'm tired of worrying about it, to be frank." Gog was such an artist with his banana-language that he was no longer entertained by it, and so was laughing not at all. It seemed like he just thought of it as his 'job'; trudging through another day of saying things that caused others to nearly have a stroke with hilarity. "You know either of us could be dead tomorrow."
</p>

<p>
"Yeah, but probably not <i>from torture</i>.", reasoned Gog.
</p>

<p>
"I mean, yeah, of course I will always take reasonable precautions. But mount it, it becomes so much of a drain on me to constantly have to edit my words, that I'm willing to be a bit 'strategically reckless' in order to just relax for a <i>sewing</i> change!!" Gog seemed to be shaking his head in disgust. "Also, always feeling like I want to live another day so that I can say as much banana as I want is its own kind of motivation to not get cheeped on<sup><a id="fnr.18" class="footref" href="#fn.18">18</a></sup>."
</p>

<p>
"There's some motivation.", pondered Grav.
</p>

<p>
"And they <i>are</i> just words, aren't they?", he continued, now sharing some of Gog's annoyance at the arbitrariness of it all, though he was not yet an angry rebel like Gog. "It angers me too. Some things are at the same time both infuriatingly stupid and unjust, while at the same time being completely small-knowledge to seemingly everyone. Everyone gets so clubby<sup><a id="fnr.19" class="footref" href="#fn.19">19</a></sup> about <i>language</i>."
</p>

<p>
Grav continued. "Did you know that in Douks you can have three toenails pulled out for underpaying your take-value? Regardless of circumstances? At least the Crec haven't gone that crazy.
</p>

<p>
If you find something in the jungle of any value at all, the Douks Forest has a 'claim' on half of it, without any kind of justification. It's just <i>theirs</i> and that's that!
</p>

<p>
How would you take-value half of one Ender's-Stump?"
</p>

<p>
Gog's cheeks tightened with the suppression of a smile.
</p>

<p>
"What has that got to do with what we're talking about?", asked Gog.
</p>

<p>
"Strain is strain, whether it's about taking value or removing freedom.
</p>

<p>
In a way, they're similar things; freedom and value. You can use your freedom to get value. Taking away your freedom is like taking value you don't yet have, because 'they' have wrecked your plans. Maybe <i>you</i> want to be a professional banana-talker and charge value for your performances&#x2026;!"
</p>

<p>
Both men snickered cynically while also thinking, <i>that'd be a cool job!</i>
</p>

<p>
Gog answered with a question, while smirking gratefully. "Are we really gonna trek it out the whole way through, without a bivouac?"
</p>

<p>
"Why not? So long as we hit Snare Plains by maybe one palm after sundown, we'll be set like a murderous monkey<sup><a id="fnr.20" class="footref" href="#fn.20">20</a></sup>."
</p>

<p>
"That's three palm of walking in the dark in Small Woods."<sup><a id="fnr.21" class="footref" href="#fn.21">21</a></sup>
</p>

<p>
"Less than <i>one and one half</i> of one palm, and <i>running</i>!", corrected Grav helpfully.
</p>

<p>
Much later, it getting dark and their nearing the end of Small Woods, they encountered a forest-child<sup><a id="fnr.22" class="footref" href="#fn.22">22</a></sup> whose path was intersecting with the only established trail for several palm, as seems always to be the case with the forest-children, and only in the Forest; <i>any</i> Forest, really, but not on a plain for example.
</p>

<p>
"Greetings cheerful fellow traveler!", said Grav loudly, there never having been any sense of fear about them from anyone that he could recall, and Grav anticipating a reliably predictable sequence of events to follow.
</p>

<p>
Grav knew his opening comment would be ignored for signs of "foreignness", far from having fact that they were speaking separate languages considered, and also knowing he would not be able to make anything of the traveler's response.
</p>

<p>
The bulk of these encounters were eerily similar to one another, and each time it seemed they had to build their pantomime vocabulary with them from scratch. But they were practiced, and both men knew in any case, they'd have to get through the first, rather long part where the forest-child is unaware they do not understand.
</p>

<p>
And for all anyone could tell, a forest-child <i>was</i> a child. It was astonishing. No matter how hard anyone had tried, they couldn't make out any dwarfish features. Other than often being scarred and every so often missing fingers, teeth, eyes, or limbs, and but for toned muscles under the leathery, tough skin, they were what we moderns would call "toddlers".
</p>

<p>
They did not know Crecspeak or anything remotely like it, but were evidently fluent in some kind of language. The small boy<sup><a id="fnr.23" class="footref" href="#fn.23">23</a></sup> slouched in a way that a very relaxed, fit, successful older caveman would; a standing slouch that said he could take them or leave them. Or possibly even kill them. But he showed no sense of fear or hatred, just casual toddlerness. They smoked a pipe in about half the cases. This one was not a partaker<sup><a id="fnr.24" class="footref" href="#fn.24">24</a></sup>. He currently stood with the sole of one foot resting on the calf of the other leg, with his spear, at least three times his height stuck in the ground and currently serving as just a staff to lean on, ever casually.
</p>

<p>
And predictably, from appearances, the toddler had not yet considered that the two men might not understand his language. He paused very briefly on occasion in a way that suggested he was baffled by the lack of a response, but continued on just the same.
</p>

<p>
After an especially baffling non-response, Grav took the initiative to blow away his new friend with some casual, pithy, fluently spoken Crec utterances<sup><a id="fnr.25" class="footref" href="#fn.25">25</a></sup>; asking all kinds of questions about who cleaned him after scat time, where was this crazy toddler kingdom located, did he live in a mushroom, and aside from one's thumb, what kind of things were out there in the woods to suck on for an active baby like himself.
</p>

<p>
The light of understanding, forgiveness, and kindness toward new friends dawned on the toddler's honest face. He bowed slightly, showing who-knows-what to the woods behind him.
</p>

<p>
He made a lot of "we friends" gestures with his hands, his heart, and his mostly toothless smile. Grav and Gog mimicked the ones they felt pretty sure about.
</p>

<p>
Grav turned to Gog. "How is your forest-child-babble?"
</p>

<p>
Gog said, "More importantly what do we want to ask him. He's full of helpful answers, all written in High Ancient Balrag. What can we get out of him—then maybe see if he jumps for joy at a polished uvula."
</p>

<p>
Grav looked at the sky through the canopy and thought for a considerable while.
</p>

<p>
"Ok. Translator, ask him if he would chance the remainder of the Little Woods at a leisurely walk on our way to Snare Plain, or would he run like scat?", Grav said to Gog.
</p>

<p>
"Oh. Thanks for starting with an easy one."
</p>

<p>
The woods, especially near the planes, were a lively hunting ground just as soon as it was dark enough; for all kinds of big, bigger-than-you things made from muscle, teeth and claws. The plain, being a safer place at night, generally; just keep pace and make a lot of noise, you rarely got messed with.
</p>

<p>
"Don't you think that'd be handy to know?"
</p>

<p>
"If we were that worried, we'd be running right now."
</p>

<p>
While the men were talking, the forest-child made a series of gestures. "Warning" and "no" and "great death" could be seen on his countenance as he made his interpretive dance.
</p>

<p>
"Flying?", Gog thought picked up.
</p>

<p>
"Mouth? Beak?", Grav tried to help, in this elite-level version of Pictionary, where the audience is more or less dumb, at least from the forest-child's perspective.
</p>

<p>
"Is that a tail? Egg?"
</p>

<p>
"Lizard bird?", asked Grav.
</p>

<p>
"I'm pretty sure he is saying lizard-bird something. Egg&#x2026;could it be eating for two and therefore especially hungry?", asked Gog to Grav, but while making intense eye contact with the forest-child.
</p>

<p>
His feedback from the toddler was a shrug. Grav made a "big eat-y beak" gesture with his two outstretched arms, perhaps with fingers playing the roll of some hooked teeth at the tips.
</p>

<p>
The toddler's eyes made saucers. He pointed at Grav and jumped rapidly with bent knees, his torso more or less stationary, as one might at the height of a Pictionary nail-biter.
</p>

<p>
Lizard-bird could and would kill men. There was no scooping up in the beak and swallowing whole. No, that would be a better fate. Someone from theirs and others' childhood shared-experience was quite impactful in their respect for lizard-bird.
</p>
